TestPlans/Car/Debenhams/xml/DCI3_21112014_11.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;KWR0104&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="8"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;20/11/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="N" /&gt;
    &lt;InsRefused abiCode="N" /&gt;
    &lt;ImposedTerms abiCode="N" /&gt;
    &lt;PrevPayment&gt;M&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;0&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;1&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC11@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01734320301&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01734320301&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;2 Duke of Edinburgh Way&lt;/Address1&gt;
    &lt;Address2&gt;Malvern&lt;/Address2&gt;
    &lt;Address3 /&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;WR14 1AZ&lt;/PostCode&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1971-11-27&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;27/11/1971&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Keith&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;HomeOwner abiCode="N" /&gt;
    &lt;LicHeld&gt;25&lt;/LicHeld&gt;
    &lt;LicType abiCode="N" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;PassPlusDate&gt;01/05/2008&lt;/PassPlusDate&gt;
    &lt;MaritalStatus abiCode="M" /&gt;
    &lt;OtherCompanyVehYears&gt;20&lt;/OtherCompanyVehYears&gt;
    &lt;Surname&gt;Eleven&lt;/Surname&gt;
    &lt;Title&gt;Mr&lt;/Title&gt;
    &lt;Conviction&gt;
      &lt;ConvictionDate&gt;01/04/2011&lt;/ConvictionDate&gt;
      &lt;Fine&gt;104&lt;/Fine&gt;
      &lt;OffenceCode&gt;CU&lt;/OffenceCode&gt;
      &lt;OffenceCodeNumber&gt;40&lt;/OffenceCodeNumber&gt;
      &lt;OffenceDate /&gt;
      &lt;Points&gt;0&lt;/Points&gt;
    &lt;/Conviction&gt;
    &lt;Conviction&gt;
      &lt;ConvictionDate&gt;01/02/2011&lt;/ConvictionDate&gt;
      &lt;Fine&gt;114&lt;/Fine&gt;
      &lt;OffenceCode&gt;DR&lt;/OffenceCode&gt;
      &lt;OffenceCodeNumber&gt;10&lt;/OffenceCodeNumber&gt;
      &lt;OffenceDate /&gt;
      &lt;Points&gt;0&lt;/Points&gt;
      &lt;SampleLevel&gt;20&lt;/SampleLevel&gt;
      &lt;SampleType abicode="1" /&gt;
    &lt;/Conviction&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/07/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;500.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="T" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/07/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="R" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="R09" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;4999&lt;/PrivateMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;01/11/2010&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;14/04/1986&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Karl&lt;/FirstName&gt;
    &lt;Gender abiCode="M" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;4&lt;/LicHeld&gt;
    &lt;LicType abiCode="N" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="M" /&gt;
    &lt;ResPeriod&gt;4&lt;/ResPeriod&gt;
    &lt;ResUnit&gt;Y&lt;/ResUnit&gt;
    &lt;Surname&gt;Eleven&lt;/Surname&gt;
    &lt;Title&gt;Mr&lt;/Title&gt;
    &lt;InfInd&gt;Y&lt;/InfInd&gt;
    &lt;Medical&gt;
      &lt;DVLAAdvisable&gt;Y&lt;/DVLAAdvisable&gt;
      &lt;DVLAAdvised&gt;Y&lt;/DVLAAdvised&gt;
      &lt;DVLALicenceIssued&gt;N&lt;/DVLALicenceIssued&gt;
    &lt;/Medical&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="F" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="49D" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="A" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;52011702&lt;/ABICode&gt;
    &lt;ImmobSecurityMake&gt;UT1&lt;/ImmobSecurityMake&gt;
    &lt;ImmobSecurityFitted&gt;Unknown&lt;/ImmobSecurityFitted&gt;
    &lt;CoverType abiCode="01" /&gt;
    &lt;EstimatedValue&gt;2345&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="9" /&gt;
    &lt;Lhd&gt;N&lt;/Lhd&gt;
    &lt;Modified abiCode="N" /&gt;
    &lt;NCBType&gt;PC&lt;/NCBType&gt;
    &lt;NCBProtected&gt;N&lt;/NCBProtected&gt;
    &lt;NCBYears&gt;20&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="1" /&gt;
    &lt;Owner abiCode="9" /&gt;
    &lt;OvernightPostCode&gt;WR14 1AZ&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;20/11/2014&lt;/PurchaseDate&gt;
    &lt;Registration&gt;X779NBM&lt;/Registration&gt;
    &lt;YearManufacture&gt;2000&lt;/YearManufacture&gt;
    &lt;Seats&gt;5&lt;/Seats&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>